content/cv.md
+++
title = "CV"
draft = false
+++

## Personal information {#personal-information}

- Name: Paweł Smulski
- Birthdate: 28.06.1999
- Residence: Poland
- Contact info:
  - Email: forlos@disroot.org
  - Phone: On demand

## Expertise {#expertise}

- **Programming**: <br />
  rust, java, python, x86 asm (reverse engineering)
- **Tools**: <br />
  git, linux, windows, gcp, aws, k8s, helm, grpc, hex-reys ida, x64dbg

Various open source projects mostly written in Rust:

- [vn_re](https://github.com/Forlos/vn%5Fre)/[akaibu](https://github.com/Forlos/akaibu) - python/rust <br />
  Reverse engineering visual novels archive and resource file formats.

## Experience {#experience}

- _**Backend developer**_ - Kalamba Games <br />
  _June 2019 - November 2020_
  - Developing microservices
  - Maintaining kubernetes clusters and microservice architecture
  - Implementing 3rd party API integrations
  - **Tech stack**: java, spring boot, k8s, grpc, kafka, postgres, elasticsearch, prometheus, gcp, aws, do
  - **Industry**: casino games provider

## Languages {#languages}

- Polish
- English

## Interests {#interests}

- Cybersecurity(reverse engineering and binary exploitation)
- Low level programming
- (E)skateboarding

## Links {#links}

- <https://github.com/forlos>
- <https://forlos.github.io>
